database_relations/app/controllers/home_controller.rb

SELECT `locations`.* FROM `locations`
---
  def index
    @locations = Location.all