database_relations/app/controllers/locations_controller.rb

  def show
    @patients = @location.patients
    @patients_waiting = @location.patients.where.not(workflow_state: "leave")
---
SELECT "patients".* FROM "patients"  WHERE "patients"."location_id" = ? AND ("patients"."workflow_state" != 'leave')  [["location_id", 1]]

  def create
    @location = Location.create location_params
---
INSERT INTO "locations" ("created_at", "name", "phone_number", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-05-22 16:19:06.275872"], ["name", "asd"], ["phone_number", ""], ["updated_at", "2014-05-22 16:19:06.275872"]]

  def destroy
    @location.delete
---
DELETE FROM `locations` WHERE `locations`.`id` = 2

  def find_location
    @location = Location.find params[:id]
---
SELECT  "locations".* FROM "locations"  WHERE "locations"."id" = ? LIMIT 1  [["id", 1]]