database_relations/app/controllers/meds_controller.rb

  def create
    @med = @patient.meds.create med_params
---
INSERT INTO `meds` (`cost`, `created_at`, `description`, `name`, `patient_id`, `updated_at`) VALUES ('$4.00', '2014-04-26 20:59:58', '', 'Comedy', 5, '2014-04-26 20:59:58')

  def destroy
    @med.delete
---
DELETE FROM `meds` WHERE `meds`.`id` = 6

  def find_patient
    @patient = @location.patients.find params[:patient_id]
---
SELECT  `patients`.* FROM `patients`  WHERE `patients`.`location_id` = 8 AND `patients`.`id` = 9 LIMIT 1

  def find_location
    @location = Location.find params[:location_id]
---
SELECT  `locations`.* FROM `locations`  WHERE `locations`.`id` = 8 LIMIT 1

  def find_med
    @med = @patient.meds.find params[:id]
---
SELECT  `meds`.* FROM `meds`  WHERE `meds`.`patient_id` = 9 AND `meds`.`id` = 6 LIMIT 1