database_relations/app/controllers/patients_controller.rb

  def show
    @meds = @patient.meds
    @patients_waiting = @location.patients.where.not(workflow_state: "leave")
---
SELECT  `patients`.* FROM `patients`  WHERE `patients`.`location_id` = 2 AND `patients`.`id` = 5 LIMIT 1

  def create
    @patient = @location.patients.create patient_params
---
INSERT INTO `patients` (`created_at`, `description`, `location_id`, `name`, `phone_number`, `updated_at`, `workflow_state`) VALUES ('2014-04-26 20:59:45', '', 2, 'Joshua Rivers', '678-936-4443', '2014-04-26 20:59:45', 'waiting')

  def destroy
    @patient.delete
---
DELETE FROM `patients` WHERE `patients`.`id` = 7

  def find_location
    @location = Location.find params[:location_id]
---
SELECT  "locations".* FROM "locations"  WHERE "locations"."id" = ? LIMIT 1  [["id", 1]]

  def find_patient
    @patient = @location.patients.find params[:id]
---
SELECT  "patients".* FROM "patients"  WHERE "patients"."location_id" = ? AND "patients"."id" = ? LIMIT 1  [["location_id", 1], ["id", 1]]