polymorphic/app/views/patients/edit.html.haml

  - @hospitals.each do |hospital|
    = check_box_tag 'patient[hospital_ids][]', hospital.id, @patient.hospitals.include?(hospital), {id: "hospital_id_#{hospital.id}"}
---
SELECT  1 AS one FROM `hospitals` INNER JOIN `locations` ON `hospitals`.`id` = `locations`.`hospital_id` WHERE `locations`.`patient_id` = 12 AND `hospitals`.`id` = 1 LIMIT 1
SELECT  `patients`.* FROM `patients` INNER JOIN `locations` ON `patients`.`id` = `locations`.`patient_id` WHERE `locations`.`hospital_id` = 1 AND `patients`.`id` = 12 LIMIT 1
SELECT `hospitals`.* FROM `hospitals`