polymorphic/app/views/patients/show.html.haml

SELECT `meds`.* FROM `meds`  WHERE `meds`.`patient_id` = 4
---
  %table
    - @patient.meds.each do |med|

SELECT `hospitals`.* FROM `hospitals` INNER JOIN `locations` ON `hospitals`.`id` = `locations`.`hospital_id` WHERE `locations`.`patient_id` = 7
---
  %table
    - @patient.hospitals.each do |hospital|