polymorphic/app/controllers/home_controller.rb

  def index
    @hospitals = Hospital.all
---
SELECT `hospitals`.* FROM `hospitals`