polymorphic/app/controllers/hospitals_controller.rb

  def create
    @hospital = Hospital.create hospital_params
---
INSERT INTO `hospitals` (`created_at`, `name`, `phone_number`, `updated_at`) VALUES ('2014-04-26 22:34:15', 'Rivers General', '770-539-3646', '2014-04-26 22:34:15')

  def show
    @patients = @hospital.patients
    @patients_waiting = @hospital.patients.where.not(workflow_state: "leave")
---
SELECT `patients`.* FROM `patients` INNER JOIN `locations` ON `patients`.`id` = `locations`.`patient_id` WHERE `locations`.`hospital_id` = 29 AND (`patients`.`workflow_state` != 'leave')

  def destroy
    @hospital.delete
---
DELETE FROM `hospitals` WHERE `hospitals`.`id` = 1

  def update
    @hospital.update_attributes hospital_params
---
UPDATE `hospitals` SET `phone_number` = '42424', `updated_at` = '2014-04-27 17:39:37' WHERE `hospitals`.`id` = 6

  def add_doctor
    @doctor = @hospital.doctors.create doctor_params
---
INSERT INTO `doctors` (`created_at`, `cureable_id`, `cureable_type`, `name`, `updated_at`) VALUES ('2014-04-27 19:27:13', 15, 'Hospital', 'Me', '2014-04-27 19:27:13')

  def delete_doctor
    @doctor = Doctor.find params[:id]
    @doctor.delete
---
SELECT  `doctors`.* FROM `doctors`  WHERE `doctors`.`id` = 14 LIMIT 1
DELETE FROM `doctors` WHERE `doctors`.`id` = 14

  def find_hospital
    @hospital = Hospital.find params[:id]
---
SELECT  `hospitals`.* FROM `hospitals`  WHERE `hospitals`.`id` = 15 LIMIT 1