polymorphic/app/controllers/meds_controller.rb

  def create
    @med = @patient.meds.create med_params
---
INSERT INTO `meds` (`created_at`, `name`, `patient_id`, `updated_at`) VALUES ('2014-04-28 12:13:17', 'Action', 4, '2014-04-28 12:13:17')

  def destroy
    @med.delete
---
DELETE FROM `meds` WHERE `meds`.`id` = 1

  def find_hospital
    @hospital = Hospital.find params[:hospital_id]
---
SELECT  `hospitals`.* FROM `hospitals`  WHERE `hospitals`.`id` = 1 LIMIT 1

  def find_patient
    @patient = @hospital.patients.find params[:patient_id]
---
SELECT  `patients`.* FROM `patients` INNER JOIN `locations` ON `patients`.`id` = `locations`.`patient_id` WHERE `locations`.`hospital_id` = 1 AND `patients`.`id` = 4 LIMIT 1

  def find_med
    @med = @patient.meds.find params[:id]
---
SELECT  `meds`.* FROM `meds`  WHERE `meds`.`patient_id` = 4 AND `meds`.`id` = 1 LIMIT 1