polymorphic/app/controllers/patients_controller.rb

  def show
    @hospitals = Hospital.all
    @meds = @patient.meds
    @patients_waiting = @hospital.patients.where.not(workflow_state: "leave")
---
SELECT `hospitals`.* FROM `hospitals`
SELECT `patients`.* FROM `patients` INNER JOIN `locations` ON `patients`.`id` = `locations`.`patient_id` WHERE `locations`.`hospital_id` = 1 AND (`patients`.`workflow_state` != 'leave')

  def new
    @hospitals = Hospital.all
---
SELECT `hospitals`.* FROM `hospitals`

  def create
    @patient = @hospital.patients.new patient_params
    if @patient.save
---
INSERT INTO `patients` (`created_at`, `email`, `name`, `phone_number`, `updated_at`, `workflow_state`) VALUES ('2014-04-29 02:56:32', 'joshua.rivers@gmail.com', 'Nick', '', '2014-04-29 02:56:32', 'waiting')

  def edit
    @hospitals = Hospital.all
---
SELECT `hospitals`.* FROM `hospitals`

  def destroy
    @patient.delete
---
DELETE FROM `patients` WHERE `patients`.`id` = 5

  def add_doctor
    @doctor = @patient.doctors.create doctor_params
---
INSERT INTO `doctors` (`created_at`, `cureable_id`, `cureable_type`, `name`, `updated_at`) VALUES ('2014-04-27 19:40:07', 27, 'Patient', 'Rich', '2014-04-27 19:40:07')

  def delete_doctor
    @doctor = Doctor.find params[:id]
    @doctor.delete
---
SELECT  `doctors`.* FROM `doctors`  WHERE `doctors`.`id` = 1 LIMIT 1
DELETE FROM `doctors` WHERE `doctors`.`id` = 1

    def find_hospital
    @hospital = Hospital.find params[:hospital_id]
---
SELECT `hospitals`.* FROM `hospitals`  WHERE `hospitals`.`id` IN (6, 7, 8, 9)

    def find_patient
      @patient = @hospital.patients.find params[:id]
---
SELECT  `patients`.* FROM `patients` INNER JOIN `locations` ON `patients`.`id` = `locations`.`patient_id` WHERE `locations`.`hospital_id` = 35 AND `patients`.`id` = 13 LIMIT 1