polymorphic/app/views/meds/_form.html.haml

    = f.label :name
    = f.select :name, options_for_select(Med::MEDS, @patient.meds), include_blank: '---Select---'
---
SELECT `meds`.* FROM `meds`  WHERE `meds`.`patient_id` = 4