database_relations/app/views/patients/show.html.haml

SELECT `meds`.* FROM `meds`  WHERE `meds`.`patient_id` = 5
---
    %ul
    - @patient.meds.each do |med|